In [2]:
import pandas as pd

In [3]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
##create a series from dictionary element
data = {'a':1,'b':2,'c':3}
series_dic = pd.Series(data)
print(series_dic)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
##DataFrame
##create a dataframe from a dictionary of list
data={
    'Name':['krish','john','jack'],
    'Age':[25,32,12],
    'City':['jsr','br','florida']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age     City
0  krish   25      jsr
1   john   32       br
2   jack   12  florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['krish', 25, 'jsr'],
       ['john', 32, 'br'],
       ['jack', 12, 'florida']], dtype=object)

In [8]:
##create a dataframe from list of dictionary
data=[
    {'Name':'Priya','Age':21,'City':'jsr'},
    {'Name':'Piyush','Age':20,'City':'jsr'},
    {'Name':'Ankit','Age':12,'City':'jsr'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age City
0   Priya   21  jsr
1  Piyush   20  jsr
2   Ankit   12  jsr
<class 'pandas.core.frame.DataFrame'>

In [11]:
ds=pd.read_csv('sales_data_sample.csv', encoding='latin1')

In [12]:
ds

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [ ]:
ds.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [13]:
ds.tail()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [14]:
#data from dataframe
df

     Name  Age City
0   Priya   21  jsr
1  Piyush   20  jsr
2   Ankit   12  jsr

In [15]:
df['Name']

0     Priya
1    Piyush
2     Ankit
Name: Name, dtype: object

In [16]:
type(df['Name'])
# Yaha column indexes automatically ban jate hain:
# 0 → Name
# 1 → Age
# 2 → City

pandas.core.series.Series

In [17]:
df.loc[0][2]

C:\Users\iamni\AppData\Local\Temp\ipykernel_27196\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'jsr'

In [18]:
# Row label = 0
# ✔ Column label = "Age"
df.loc[0, "Age"]

np.int64(21)

In [19]:
# ✔ 0th & 2nd row + "Name" column
df.loc[[0, 2], "Name"]

0    Priya
2    Ankit
Name: Name, dtype: object

In [20]:
# ✔ Saari row label 1
df.loc[1]

Name    Piyush
Age         20
City       jsr
Name: 1, dtype: object

In [21]:
# Row positions 0 & 2, Column position 0
df.iloc[[0, 2], 0]

0    Priya
2    Ankit
Name: Name, dtype: object

In [22]:
df.iloc[0,0]

'Priya'

In [23]:

# First 2 rows, first 2 columns
df.iloc[0:2, 0:2]

     Name  Age
0   Priya   21
1  Piyush   20

In [24]:
##accessing a specified element
df

     Name  Age City
0   Priya   21  jsr
1  Piyush   20  jsr
2   Ankit   12  jsr

In [25]:
df.at[2,'Age']

np.int64(12)

In [26]:
df.at[2,'Name']

'Ankit'

In [27]:
##accessing specified element using iat
df.iat[2,2]

'jsr'

In [28]:
##adding a column
df['salary'] = [5000,6000,7000]
df

     Name  Age City  salary
0   Priya   21  jsr    5000
1  Piyush   20  jsr    6000
2   Ankit   12  jsr    7000

In [29]:
##removing a column
#df.drop() ko ye nahi pata hota ki tum row drop karna chahte ho ya column drop.
# axis=0 → rows(default)
# axis=1 → columns
df.drop('salary',axis=1)

     Name  Age City
0   Priya   21  jsr
1  Piyush   20  jsr
2   Ankit   12  jsr

In [30]:
df
#still in table salary column(do not saved yet)

     Name  Age City  salary
0   Priya   21  jsr    5000
1  Piyush   20  jsr    6000
2   Ankit   12  jsr    7000

In [31]:
#to save it permanently do implace =true
df.drop('salary',axis=1)

     Name  Age City
0   Priya   21  jsr
1  Piyush   20  jsr
2   Ankit   12  jsr

In [32]:
df['Age'] = df['Age']+1
df

     Name  Age City  salary
0   Priya   22  jsr    5000
1  Piyush   21  jsr    6000
2   Ankit   13  jsr    7000

In [33]:
df.drop(0)

     Name  Age City  salary
1  Piyush   21  jsr    6000
2   Ankit   13  jsr    7000

In [34]:
ds

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [35]:
ds.describe()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,7.092455,2003.81509,100.715551
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,3.656633,0.69967,40.187912
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,2003.00000,33.000000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,4.000000,2003.00000,68.000000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,8.000000,2004.00000,99.000000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,11.000000,2004.00000,124.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,12.000000,2005.00000,214.000000

In [36]:
ds.dtypes

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [37]:
#handling missing values
ds.isnull()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,True,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,False,False,False,False,False,False,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
2819,False,False,False,False,False,False,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
2820,False,False,False,False,False,False,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
2821,False,False,False,False,False,False,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
2822,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,True,False,False,False

In [38]:
ds.isnull().any()

ORDERNUMBER         False
QUANTITYORDERED     False
PRICEEACH           False
ORDERLINENUMBER     False
SALES               False
ORDERDATE           False
STATUS              False
QTR_ID              False
MONTH_ID            False
YEAR_ID             False
PRODUCTLINE         False
MSRP                False
PRODUCTCODE         False
CUSTOMERNAME        False
PHONE               False
ADDRESSLINE1        False
ADDRESSLINE2         True
CITY                False
STATE                True
POSTALCODE           True
COUNTRY             False
TERRITORY            True
CONTACTLASTNAME     False
CONTACTFIRSTNAME    False
DEALSIZE            False
dtype: bool

In [39]:
ds.isnull().sum()

ORDERNUMBER            0
QUANTITYORDERED        0
PRICEEACH              0
ORDERLINENUMBER        0
SALES                  0
ORDERDATE              0
STATUS                 0
QTR_ID                 0
MONTH_ID               0
YEAR_ID                0
PRODUCTLINE            0
MSRP                   0
PRODUCTCODE            0
CUSTOMERNAME           0
PHONE                  0
ADDRESSLINE1           0
ADDRESSLINE2        2521
CITY                   0
STATE               1486
POSTALCODE            76
COUNTRY                0
TERRITORY           1074
CONTACTLASTNAME        0
CONTACTFIRSTNAME       0
DEALSIZE               0
dtype: int64

In [75]:
##filling with missing values
data = [
    {'Name': 'Priya',  'Age': 21,  'Salary': 45000, 'Score': 89, 'City': 'Delhi'},
    {'Name': 'Piyush', 'Age': None, 'Salary': 52000, 'Score': 76, 'City': 'Mumbai'},
    {'Name': 'Ankit',  'Age': 31,  'Salary': None, 'Score': 92, 'City': 'Bangalore'},
    {'Name': 'Riya',   'Age': 28,  'Salary': 61000, 'Score': None, 'City': 'Hyderabad'},
    {'Name': 'Aman',   'Age': None, 'Salary': 48000, 'Score': 67, 'City': 'Pune'},
    {'Name': 'Kiran',  'Age': 21,  'Salary': None, 'Score': 81, 'City': 'Delhi'},
    {'Name': 'Neha',   'Age': 35,  'Salary': 72000, 'Score': None, 'City': 'Kolkata'},
    {'Name': 'Rohan',  'Age': None, 'Salary': 54000, 'Score': 73, 'City': 'Jaipur'},
    {'Name': 'Manav',  'Age': 27,  'Salary': None, 'Score': 65, 'City': 'Surat'},
    {'Name': 'Diya',   'Age': 30,  'Salary': 50000, 'Score': None, 'City': 'Delhi'},
    {'Name': 'Alok',   'Age': None, 'Salary': 58000, 'Score': 91, 'City': 'Patna'},
    {'Name': 'Swati',  'Age': 26,  'Salary': None, 'Score': 74, 'City': 'Nagpur'},
    {'Name': 'Vikas',  'Age': 34,  'Salary': 69000, 'Score': None, 'City': 'Indore'},
    {'Name': 'Nisha',  'Age': None, 'Salary': 45500, 'Score': 80, 'City': 'Delhi'},
    {'Name': 'Harsh',  'Age': 32,  'Salary': None, 'Score': 88, 'City': 'Varanasi'},
    {'Name': 'Kabir',  'Age': 29,  'Salary': 53000, 'Score': None, 'City': 'Kanpur'},
    {'Name': 'Tina',   'Age': None, 'Salary': 60000, 'Score': 79, 'City': 'Ranchi'},
    {'Name': 'Arjun',  'Age': 33,  'Salary': None, 'Score': 82, 'City': 'Guwahati'},
    {'Name': 'Sana',   'Age': 24,  'Salary': 47000, 'Score': None, 'City': 'Lucknow'},
    {'Name': 'Yash',   'Age': None, 'Salary': 51000, 'Score': 75, 'City': 'Chandigarh'}
]
dp = pd.DataFrame(data)
print(dp)

      Name   Age   Salary  Score        City
0    Priya  21.0  45000.0   89.0       Delhi
1   Piyush   NaN  52000.0   76.0      Mumbai
2    Ankit  31.0      NaN   92.0   Bangalore
3     Riya  28.0  61000.0    NaN   Hyderabad
4     Aman   NaN  48000.0   67.0        Pune
5    Kiran  21.0      NaN   81.0       Delhi
6     Neha  35.0  72000.0    NaN     Kolkata
7    Rohan   NaN  54000.0   73.0      Jaipur
8    Manav  27.0      NaN   65.0       Surat
9     Diya  30.0  50000.0    NaN       Delhi
10    Alok   NaN  58000.0   91.0       Patna
11   Swati  26.0      NaN   74.0      Nagpur
12   Vikas  34.0  69000.0    NaN      Indore
13   Nisha   NaN  45500.0   80.0       Delhi
14   Harsh  32.0      NaN   88.0    Varanasi
15   Kabir  29.0  53000.0    NaN      Kanpur
16    Tina   NaN  60000.0   79.0      Ranchi
17   Arjun  33.0      NaN   82.0    Guwahati
18    Sana  24.0  47000.0    NaN     Lucknow
19    Yash   NaN  51000.0   75.0  Chandigarh

In [76]:
dp['score_all'] = dp['Score'].fillna(dp['Score'].mean())

In [77]:
dp['score_all']

0     89.000000
1     76.000000
2     92.000000
3     79.428571
4     67.000000
5     81.000000
6     79.428571
7     73.000000
8     65.000000
9     79.428571
10    91.000000
11    74.000000
12    79.428571
13    80.000000
14    88.000000
15    79.428571
16    79.000000
17    82.000000
18    79.428571
19    75.000000
Name: score_all, dtype: float64

In [78]:
dp =dp.rename(columns={'Score':'Scores'})
dp

      Name   Age   Salary  Scores        City  score_all
0    Priya  21.0  45000.0    89.0       Delhi  89.000000
1   Piyush   NaN  52000.0    76.0      Mumbai  76.000000
2    Ankit  31.0      NaN    92.0   Bangalore  92.000000
3     Riya  28.0  61000.0     NaN   Hyderabad  79.428571
4     Aman   NaN  48000.0    67.0        Pune  67.000000
5    Kiran  21.0      NaN    81.0       Delhi  81.000000
6     Neha  35.0  72000.0     NaN     Kolkata  79.428571
7    Rohan   NaN  54000.0    73.0      Jaipur  73.000000
8    Manav  27.0      NaN    65.0       Surat  65.000000
9     Diya  30.0  50000.0     NaN       Delhi  79.428571
10    Alok   NaN  58000.0    91.0       Patna  91.000000
11   Swati  26.0      NaN    74.0      Nagpur  74.000000
12   Vikas  34.0  69000.0     NaN      Indore  79.428571
13   Nisha   NaN  45500.0    80.0       Delhi  80.000000
14   Harsh  32.0      NaN    88.0    Varanasi  88.000000
15   Kabir  29.0  53000.0     NaN      Kanpur  79.428571
16    Tina   NaN  60000.0    79.0      Ranchi  79.000000
17   Arjun  33.0      NaN    82.0    Guwahati  82.000000
18    Sana  24.0  47000.0     NaN     Lucknow  79.428571
19    Yash   NaN  51000.0    75.0  Chandigarh  75.000000

In [79]:
##change datatype
dp['Scores'] = dp['Scores'].fillna(dp['Scores'].mean()).astype(int)
dp

      Name   Age   Salary  Scores        City  score_all
0    Priya  21.0  45000.0      89       Delhi  89.000000
1   Piyush   NaN  52000.0      76      Mumbai  76.000000
2    Ankit  31.0      NaN      92   Bangalore  92.000000
3     Riya  28.0  61000.0      79   Hyderabad  79.428571
4     Aman   NaN  48000.0      67        Pune  67.000000
5    Kiran  21.0      NaN      81       Delhi  81.000000
6     Neha  35.0  72000.0      79     Kolkata  79.428571
7    Rohan   NaN  54000.0      73      Jaipur  73.000000
8    Manav  27.0      NaN      65       Surat  65.000000
9     Diya  30.0  50000.0      79       Delhi  79.428571
10    Alok   NaN  58000.0      91       Patna  91.000000
11   Swati  26.0      NaN      74      Nagpur  74.000000
12   Vikas  34.0  69000.0      79      Indore  79.428571
13   Nisha   NaN  45500.0      80       Delhi  80.000000
14   Harsh  32.0      NaN      88    Varanasi  88.000000
15   Kabir  29.0  53000.0      79      Kanpur  79.428571
16    Tina   NaN  60000.0      79      Ranchi  79.000000
17   Arjun  33.0      NaN      82    Guwahati  82.000000
18    Sana  24.0  47000.0      79     Lucknow  79.428571
19    Yash   NaN  51000.0      75  Chandigarh  75.000000

In [80]:
dp['New_Value'] = dp['Salary'] + (dp['Salary']*10)/100
dp

      Name   Age   Salary  Scores        City  score_all  New_Value
0    Priya  21.0  45000.0      89       Delhi  89.000000    49500.0
1   Piyush   NaN  52000.0      76      Mumbai  76.000000    57200.0
2    Ankit  31.0      NaN      92   Bangalore  92.000000        NaN
3     Riya  28.0  61000.0      79   Hyderabad  79.428571    67100.0
4     Aman   NaN  48000.0      67        Pune  67.000000    52800.0
5    Kiran  21.0      NaN      81       Delhi  81.000000        NaN
6     Neha  35.0  72000.0      79     Kolkata  79.428571    79200.0
7    Rohan   NaN  54000.0      73      Jaipur  73.000000    59400.0
8    Manav  27.0      NaN      65       Surat  65.000000        NaN
9     Diya  30.0  50000.0      79       Delhi  79.428571    55000.0
10    Alok   NaN  58000.0      91       Patna  91.000000    63800.0
11   Swati  26.0      NaN      74      Nagpur  74.000000        NaN
12   Vikas  34.0  69000.0      79      Indore  79.428571    75900.0
13   Nisha   NaN  45500.0      80       Delhi  80.000000    50050.0
14   Harsh  32.0      NaN      88    Varanasi  88.000000        NaN
15   Kabir  29.0  53000.0      79      Kanpur  79.428571    58300.0
16    Tina   NaN  60000.0      79      Ranchi  79.000000    66000.0
17   Arjun  33.0      NaN      82    Guwahati  82.000000        NaN
18    Sana  24.0  47000.0      79     Lucknow  79.428571    51700.0
19    Yash   NaN  51000.0      75  Chandigarh  75.000000    56100.0

In [81]:
dp['New_Values']=dp['New_Value'].apply(lambda x:x/2)
dp

,Name,Age,Salary,Scores,City,score_all,New_Value,New_Values
0,Priya,21.0,45000.0,89,Delhi,89.000000,49500.0,24750.0
1,Piyush,NaN,52000.0,76,Mumbai,76.000000,57200.0,28600.0
2,Ankit,31.0,NaN,92,Bangalore,92.000000,NaN,NaN
3,Riya,28.0,61000.0,79,Hyderabad,79.428571,67100.0,33550.0
4,Aman,NaN,48000.0,67,Pune,67.000000,52800.0,26400.0
5,Kiran,21.0,NaN,81,Delhi,81.000000,NaN,NaN
6,Neha,35.0,72000.0,79,Kolkata,79.428571,79200.0,39600.0
7,Rohan,NaN,54000.0,73,Jaipur,73.000000,59400.0,29700.0
8,Manav,27.0,NaN,65,Surat,65.000000,NaN,NaN
9,Diya,30.0,50000.0,79,Delhi,79.428571,55000.0,27500.0
10,Alok,NaN,58000.0,91,Patna,91.000000,63800.0,31900.0
11,Swati,26.0,NaN,74,Nagpur,74.000000,NaN,NaN
12,Vikas,34.0,69000.0,79,Indore,79.428571,75900.0,37950.0
13,Nisha,NaN,45500.0,80,Delhi,80.000000,50050.0,25025.0
14,Harsh,32.0,NaN,88,Varanasi,88.000000,NaN,NaN
15,Kabir,29.0,53000.0,79,Kanpur,79.428571,58300.0,29150.0
16,Tina,NaN,60000.0,79,Ranchi,79.000000,66000.0,33000.0
17,Arjun,33.0,NaN,82,Guwahati,82.000000,NaN,NaN
18,Sana,24.0,47000.0,79,Lucknow,79.428571,51700.0,25850.0
19,Yash,NaN,51000.0,75,Chandigarh,75.000000,56100.0,28050.0

In [82]:
#data agregating and grouping
dp.head()

     Name   Age   Salary  Scores       City  score_all  New_Value  New_Values
0   Priya  21.0  45000.0      89      Delhi  89.000000    49500.0     24750.0
1  Piyush   NaN  52000.0      76     Mumbai  76.000000    57200.0     28600.0
2   Ankit  31.0      NaN      92  Bangalore  92.000000        NaN         NaN
3    Riya  28.0  61000.0      79  Hyderabad  79.428571    67100.0     33550.0
4    Aman   NaN  48000.0      67       Pune  67.000000    52800.0     26400.0

In [83]:
grouped_mean = dp.groupby('City')['Scores'].mean()
print(grouped_mean)

City
Bangalore     92.00
Chandigarh    75.00
Delhi         82.25
Guwahati      82.00
Hyderabad     79.00
Indore        79.00
Jaipur        73.00
Kanpur        79.00
Kolkata       79.00
Lucknow       79.00
Mumbai        76.00
Nagpur        74.00
Patna         91.00
Pune          67.00
Ranchi        79.00
Surat         65.00
Varanasi      88.00
Name: Scores, dtype: float64

In [84]:
grouped_sum=dp.groupby(['City','Age'])['Scores'].sum()
grouped_sum

City       Age
Bangalore  31.0     92
Delhi      21.0    170
           30.0     79
Guwahati   33.0     82
Hyderabad  28.0     79
Indore     34.0     79
Kanpur     29.0     79
Kolkata    35.0     79
Lucknow    24.0     79
Nagpur     26.0     74
Surat      27.0     65
Varanasi   32.0     88
Name: Scores, dtype: int64

In [85]:
grouped_sum=dp.groupby(['City','Age'])['Scores'].mean()
grouped_sum

City       Age
Bangalore  31.0    92.0
Delhi      21.0    85.0
           30.0    79.0
Guwahati   33.0    82.0
Hyderabad  28.0    79.0
Indore     34.0    79.0
Kanpur     29.0    79.0
Kolkata    35.0    79.0
Lucknow    24.0    79.0
Nagpur     26.0    74.0
Surat      27.0    65.0
Varanasi   32.0    88.0
Name: Scores, dtype: float64

In [86]:
##aggregate multiple functions
grouped_aggr=dp.groupby(['City'])['Scores'].agg(['mean','sum','count'])
grouped_aggr

             mean  sum  count
City
Bangalore   92.00   92      1
Chandigarh  75.00   75      1
Delhi       82.25  329      4
Guwahati    82.00   82      1
Hyderabad   79.00   79      1
Indore      79.00   79      1
Jaipur      73.00   73      1
Kanpur      79.00   79      1
Kolkata     79.00   79      1
Lucknow     79.00   79      1
Mumbai      76.00   76      1
Nagpur      74.00   74      1
Patna       91.00   91      1
Pune        67.00   67      1
Ranchi      79.00   79      1
Surat       65.00   65      1
Varanasi    88.00   88      1

In [89]:
##merging and joining dataframes
df1=pd.DataFrame({'Key':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'Key':['A','B','D'],'Value1':[4,5,6]})
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [90]:
df2

  Key  Value1
0   A       4
1   B       5
2   D       6

In [92]:
##merge dataframe on key columns
pd.merge(df1,df2,on="Key",how="inner")

  Key  Value1_x  Value1_y
0   A         1         4
1   B         2         5

In [93]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1_x  Value1_y
0   A       1.0       4.0
1   B       2.0       5.0
2   C       3.0       NaN
3   D       NaN       6.0

In [94]:
pd.merge(df1,df2,on="Key",how="left")

  Key  Value1_x  Value1_y
0   A         1       4.0
1   B         2       5.0
2   C         3       NaN

In [95]:
pd.merge(df1,df2,on="Key",how="right")

  Key  Value1_x  Value1_y
0   A       1.0         4
1   B       2.0         5
2   D       NaN         6